pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr5992.h
/* eUSCI_B1 Register Offsets */
#define OFS_UCB1CTLW0                    (0x0000)
#define OFS_UCB1CTLW0_L                  OFS_UCB1CTLW0
#define OFS_UCB1CTLW0_H                  OFS_UCB1CTLW0+1
#define OFS_UCB1CTLW1                    (0x0002)
#define OFS_UCB1CTLW1_L                  OFS_UCB1CTLW1
#define OFS_UCB1CTLW1_H                  OFS_UCB1CTLW1+1
#define OFS_UCB1BRW                      (0x0006)
#define OFS_UCB1BRW_L                    OFS_UCB1BRW
#define OFS_UCB1BRW_H                    OFS_UCB1BRW+1
#define OFS_UCB1STATW                    (0x0008)
#define OFS_UCB1STATW_L                  OFS_UCB1STATW
#define OFS_UCB1STATW_H                  OFS_UCB1STATW+1
#define OFS_UCB1TBCNT                    (0x000A)
#define OFS_UCB1TBCNT_L                  OFS_UCB1TBCNT
#define OFS_UCB1TBCNT_H                  OFS_UCB1TBCNT+1
#define OFS_UCB1RXBUF                    (0x000C)
#define OFS_UCB1RXBUF_L                  OFS_UCB1RXBUF
#define OFS_UCB1RXBUF_H                  OFS_UCB1RXBUF+1
#define OFS_UCB1TXBUF                    (0x000E)
#define OFS_UCB1TXBUF_L                  OFS_UCB1TXBUF
#define OFS_UCB1TXBUF_H                  OFS_UCB1TXBUF+1
#define OFS_UCB1I2COA0                   (0x0014)
#define OFS_UCB1I2COA0_L                 OFS_UCB1I2COA0
#define OFS_UCB1I2COA0_H                 OFS_UCB1I2COA0+1
#define OFS_UCB1I2COA1                   (0x0016)
#define OFS_UCB1I2COA1_L                 OFS_UCB1I2COA1
#define OFS_UCB1I2COA1_H                 OFS_UCB1I2COA1+1
#define OFS_UCB1I2COA2                   (0x0018)
#define OFS_UCB1I2COA2_L                 OFS_UCB1I2COA2
#define OFS_UCB1I2COA2_H                 OFS_UCB1I2COA2+1
#define OFS_UCB1I2COA3                   (0x001A)
#define OFS_UCB1I2COA3_L                 OFS_UCB1I2COA3
#define OFS_UCB1I2COA3_H                 OFS_UCB1I2COA3+1
#define OFS_UCB1ADDRX                    (0x001C)
#define OFS_UCB1ADDRX_L                  OFS_UCB1ADDRX
#define OFS_UCB1ADDRX_H                  OFS_UCB1ADDRX+1
#define OFS_UCB1ADDMASK                  (0x001E)
#define OFS_UCB1ADDMASK_L                OFS_UCB1ADDMASK
#define OFS_UCB1ADDMASK_H                OFS_UCB1ADDMASK+1
#define OFS_UCB1I2CSA                    (0x0020)
#define OFS_UCB1I2CSA_L                  OFS_UCB1I2CSA
#define OFS_UCB1I2CSA_H                  OFS_UCB1I2CSA+1
#define OFS_UCB1IE                       (0x002A)
#define OFS_UCB1IE_L                     OFS_UCB1IE
#define OFS_UCB1IE_H                     OFS_UCB1IE+1
#define OFS_UCB1IFG                      (0x002C)
#define OFS_UCB1IFG_L                    OFS_UCB1IFG
#define OFS_UCB1IFG_H                    OFS_UCB1IFG+1
#define OFS_UCB1IV                       (0x002E)
#define OFS_UCB1IV_L                     OFS_UCB1IV
#define OFS_UCB1IV_H                     OFS_UCB1IV+1

/* No control bits available or already defined for another module */

/*****************************************************************************
 eUSCI_B2 Registers
*****************************************************************************/

#define __MSP430_HAS_EUSCI_B2__               /* Definition to show that module is available */
#ifndef __MSP430_HAS_EUSCI_Bx__
#define __MSP430_HAS_EUSCI_Bx__
#endif
#define __MSP430_BASEADDRESS_EUSCI_B2__ 0x06C0
#define EUSCI_B2_BASE          __MSP430_BASEADDRESS_EUSCI_B2__

sfr_w(UCB2CTLW0);                             /* eUSCI_Bx Control Word Register 0 */
sfr_b(UCB2CTLW0_L);
sfr_b(UCB2CTLW0_H);
sfr_w(UCB2CTLW1);                             /* eUSCI_Bx Control Word Register 1 */
sfr_b(UCB2CTLW1_L);
sfr_b(UCB2CTLW1_H);
sfr_w(UCB2BRW);                               /* eUSCI_Bx Baud Rate Control Word Register */
sfr_b(UCB2BRW_L);
sfr_b(UCB2BRW_H);
sfr_w(UCB2STATW);                             /* eUSCI_Bx Status Register */
sfr_b(UCB2STATW_L);
sfr_b(UCB2STATW_H);
sfr_w(UCB2TBCNT);                             /* eUSCI_Bx Byte Counter Threshold Register */
sfr_b(UCB2TBCNT_L);
sfr_b(UCB2TBCNT_H);
sfr_w(UCB2RXBUF);                             /* eUSCI_Bx Receive Buffer Register */
sfr_b(UCB2RXBUF_L);
sfr_b(UCB2RXBUF_H);
sfr_w(UCB2TXBUF);                             /* eUSCI_Bx Transmit Buffer Register */
sfr_b(UCB2TXBUF_L);
sfr_b(UCB2TXBUF_H);
sfr_w(UCB2I2COA0);                            /* eUSCI_Bx I2C Own Address 0 Register */
sfr_b(UCB2I2COA0_L);
sfr_b(UCB2I2COA0_H);
sfr_w(UCB2I2COA1);                            /* eUSCI_Bx I2C Own Address 1 Register */
sfr_b(UCB2I2COA1_L);
sfr_b(UCB2I2COA1_H);
sfr_w(UCB2I2COA2);                            /* eUSCI_Bx I2C Own Address 2 Register */
sfr_b(UCB2I2COA2_L);
sfr_b(UCB2I2COA2_H);
sfr_w(UCB2I2COA3);                            /* eUSCI_Bx I2C Own Address 3 Register */
sfr_b(UCB2I2COA3_L);
sfr_b(UCB2I2COA3_H);
sfr_w(UCB2ADDRX);                             /* eUSCI_Bx I2C Received Address Register */
sfr_b(UCB2ADDRX_L);
sfr_b(UCB2ADDRX_H);
sfr_w(UCB2ADDMASK);                           /* eUSCI_Bx I2C Address Mask Register */
sfr_b(UCB2ADDMASK_L);
sfr_b(UCB2ADDMASK_H);
sfr_w(UCB2I2CSA);                             /* eUSCI_Bx I2C Slave Address Register */
sfr_b(UCB2I2CSA_L);
sfr_b(UCB2I2CSA_H);
sfr_w(UCB2IE);                                /* eUSCI_Bx Interrupt Enable Register */
sfr_b(UCB2IE_L);
sfr_b(UCB2IE_H);
sfr_w(UCB2IFG);                               /* eUSCI_Bx Interrupt Flag Register */
sfr_b(UCB2IFG_L);
sfr_b(UCB2IFG_H);
sfr_w(UCB2IV);                                /* eUSCI_Bx Interrupt Vector Register */
sfr_b(UCB2IV_L);
sfr_b(UCB2IV_H);

/* eUSCI_B2 Register Offsets */
#define OFS_UCB2CTLW0                    (0x0000)
#define OFS_UCB2CTLW0_L                  OFS_UCB2CTLW0
#define OFS_UCB2CTLW0_H                  OFS_UCB2CTLW0+1
#define OFS_UCB2CTLW1                    (0x0002)
#define OFS_UCB2CTLW1_L                  OFS_UCB2CTLW1
#define OFS_UCB2CTLW1_H                  OFS_UCB2CTLW1+1
#define OFS_UCB2BRW                      (0x0006)
#define OFS_UCB2BRW_L                    OFS_UCB2BRW
#define OFS_UCB2BRW_H                    OFS_UCB2BRW+1
#define OFS_UCB2STATW                    (0x0008)
#define OFS_UCB2STATW_L                  OFS_UCB2STATW
#define OFS_UCB2STATW_H                  OFS_UCB2STATW+1
#define OFS_UCB2TBCNT                    (0x000A)
#define OFS_UCB2TBCNT_L                  OFS_UCB2TBCNT
#define OFS_UCB2TBCNT_H                  OFS_UCB2TBCNT+1
#define OFS_UCB2RXBUF                    (0x000C)
#define OFS_UCB2RXBUF_L                  OFS_UCB2RXBUF
#define OFS_UCB2RXBUF_H                  OFS_UCB2RXBUF+1
#define OFS_UCB2TXBUF                    (0x000E)
#define OFS_UCB2TXBUF_L                  OFS_UCB2TXBUF
#define OFS_UCB2TXBUF_H                  OFS_UCB2TXBUF+1
#define OFS_UCB2I2COA0                   (0x0014)
#define OFS_UCB2I2COA0_L                 OFS_UCB2I2COA0
#define OFS_UCB2I2COA0_H                 OFS_UCB2I2COA0+1
#define OFS_UCB2I2COA1                   (0x0016)
#define OFS_UCB2I2COA1_L                 OFS_UCB2I2COA1
#define OFS_UCB2I2COA1_H                 OFS_UCB2I2COA1+1
#define OFS_UCB2I2COA2                   (0x0018)
#define OFS_UCB2I2COA2_L                 OFS_UCB2I2COA2
#define OFS_UCB2I2COA2_H                 OFS_UCB2I2COA2+1
#define OFS_UCB2I2COA3                   (0x001A)
#define OFS_UCB2I2COA3_L                 OFS_UCB2I2COA3
#define OFS_UCB2I2COA3_H                 OFS_UCB2I2COA3+1
#define OFS_UCB2ADDRX                    (0x001C)
#define OFS_UCB2ADDRX_L                  OFS_UCB2ADDRX
#define OFS_UCB2ADDRX_H                  OFS_UCB2ADDRX+1
#define OFS_UCB2ADDMASK                  (0x001E)
#define OFS_UCB2ADDMASK_L                OFS_UCB2ADDMASK
#define OFS_UCB2ADDMASK_H                OFS_UCB2ADDMASK+1
#define OFS_UCB2I2CSA                    (0x0020)
#define OFS_UCB2I2CSA_L                  OFS_UCB2I2CSA
#define OFS_UCB2I2CSA_H                  OFS_UCB2I2CSA+1
#define OFS_UCB2IE                       (0x002A)
#define OFS_UCB2IE_L                     OFS_UCB2IE
#define OFS_UCB2IE_H                     OFS_UCB2IE+1
#define OFS_UCB2IFG                      (0x002C)
#define OFS_UCB2IFG_L                    OFS_UCB2IFG
#define OFS_UCB2IFG_H                    OFS_UCB2IFG+1
#define OFS_UCB2IV                       (0x002E)
#define OFS_UCB2IV_L                     OFS_UCB2IV
#define OFS_UCB2IV_H                     OFS_UCB2IV+1

